MFF 3.4

* Roaster

| Name | Rank | Mastery | Level | g1 | g2 | g3 | g4 | ISO | Obelisk |
|------+------+---------+-------+----+----+----+----+-----+---------|
|      |      |         |       |    |    |    |    |     |         |

* Cards
| N | P1 | P2 | O1 | O2 | O3 |
|---+----+----+----+----+----|
| 1 |    |    |    |    |    |
| 2 |    |    |    |    |    |
| 3 |    |    |    |    |    |
| 4 |    |    |    |    |    |
| 5 |    |    |    |    |    |

* Income
** Gold
** BAM/CNS
** Mut mat
* Uniforms

| Hero | Lvl |
|------+-----|
|      |     |
* Shadowland

| Floor | Mode | B | C | S | M | F | H | V | Add | Clear |
|-------+------+---+---+---+---+---+---+---+-----+-------|
|     1 |      |   |   |   |   |   |   |   |     |       |
|     2 |      |   |   |   |   |   |   |   |     |       |
|     3 |      |   |   |   |   |   |   |   |     |       |
|     4 |      |   |   |   |   |   |   |   |     |       |
|     5 |      |   |   |   |   |   |   |   |     |       |
|     6 |      |   |   |   |   |   |   |   |     |       |
|     7 |      |   |   |   |   |   |   |   |     |       |
|     8 |      |   |   |   |   |   |   |   |     |       |
|     9 |      |   |   |   |   |   |   |   |     |       |
|    10 |      |   |   |   |   |   |   |   |     |       |
|    11 |      |   |   |   |   |   |   |   |     |       |
|    12 |      |   |   |   |   |   |   |   |     |       |
|    13 |      |   |   |   |   |   |   |   |     |       |
|    14 |      |   |   |   |   |   |   |   |     |       |
|    15 |      |   |   |   |   |   |   |   |     |       |
|    16 |      |   |   |   |   |   |   |   |     |       |
|    17 |      |   |   |   |   |   |   |   |     |       |
|    18 |      |   |   |   |   |   |   |   |     |       |
|    19 |      |   |   |   |   |   |   |   |     |       |
|    20 |      |   |   |   |   |   |   |   |     |       |
|    21 |      |   |   |   |   |   |   |   |     |       |
|    22 |      |   |   |   |   |   |   |   |     |       |
|    23 |      |   |   |   |   |   |   |   |     |       |
|    24 |      |   |   |   |   |   |   |   |     |       |
|    25 |      |   |   |   |   |   |   |   |     |       |
|    26 |      |   |   |   |   |   |   |   |     |       |
|    27 |      |   |   |   |   |   |   |   |     |       |
|    28 |      |   |   |   |   |   |   |   |     |       |
|    29 |      |   |   |   |   |   |   |   |     |       |
|    30 |      |   |   |   |   |   |   |   |     |       |

* Costs
** Nomal
** Native T2

R(ank)1: Black Order, Quicksilver
R(rank)2: Thanos, Odin, Dormammu, Scarlet Witch

M(utants): Cable, Jean

*** R1/2: BAM + CNS
| Requirement          | Black Order, Quicksilver | Thanos, Odin, Dormammu, Scarlett Witch |
|----------------------+--------------------------+----------------------------------------|
| R1 BAM for 6*        | 4,400                    | 8,800                                  |
| Gold for 6*          | 31,125,000               | 62,250,000                             |
| Bios for Lv.60       | 3,004                    | 6,008                                  |
| CNS for 6* mastery   | 1,350                    | 2,700                                  |
| Gold for 6* mastery  | 2,100,000                | 4,200,000                              |
| R1 BAM for max gears | ~1,350                   | ~1,350                                 |
| Gold for max gears   | ~12,209,200              | ~12,209,200                            |
| Gold for max skills  | 10,972,500               | 10,972,500                             |
|----------------------+--------------------------+----------------------------------------|
| Total Gold           | ~56,406,700              | ~89,631,700                            |

*** R1 Rank:
| From | To |    Gold | BAM  | Gold total | R1BAM tootal |
|------+----+---------+------+------------+--------------|
|    1 |  2 |  500000 | 6*R2 |    1250000 |          300 |
|    2 |  3 |  750000 | 5*R3 |    2937500 |          500 |
|    3 |  4 | 1000000 | 4*R4 |    5500000 |          800 |
|    4 |  5 | 1250000 | 3*R5 |    8937500 |         1200 |
|    5 |  6 | 1500000 | 2*R6 |   12500000 |         1600 |
|------+----+---------+------+------------+--------------|
|    1 |  6 | 5000000 |      |   31125000 |         4400 |
#+TBLFM: @7$3=vsum(@2..@6)
#+TBLFM: @7$5=vsum(@2..@6)
#+TBLFM: @7$6=vsum(@2..@6)

*** R2 Rank:
| From | To |     Gold | BAM   | Gold total | R1BAM tootal |
|------+----+----------+-------+------------+--------------|
|    1 |  2 |  1000000 | 12*R2 |    2500000 |          600 |
|    2 |  3 |  1500000 | 10*R3 |    5875000 |         1000 |
|    3 |  4 |  2000000 | 8*R4  |   11000000 |         1600 |
|    4 |  5 |  2500000 | 6*R5  |   17875000 |         2400 |
|    1 |  6 |  3000000 | 4*R6  |   25000000 |         3200 |
|------+----+----------+-------+------------+--------------|
|    1 |  6 | 10000000 |       |   62250000 |         8800 |
#+TBLFM: @7$3=vsum(@2..@6)
#+TBLFM: @7$5=vsum(@2..@6)
#+TBLFM: @7$6=vsum(@2..@6)

*** Mastery:
| From | To | R1 CNS | R1 Gold | R2 CNS | R2 Gold |
|------+----+--------+---------+--------+---------|
|    0 |  1 |    100 |  100000 |    200 |  200000 |
|    1 |  2 |    150 |  200000 |    300 |  400000 |
|    2 |  3 |    200 |  300000 |    400 |  600000 |
|    3 |  4 |    250 |  400000 |    500 |  800000 |
|    4 |  5 |    300 |  500000 |    600 | 1000000 |
|    5 |  6 |    350 |  600000 |    700 | 1200000 |
|------+----+--------+---------+--------+---------|
|   15 | 21 |   1350 | 2100000 |   2700 | 4200000 |
#+TBLFM: @8=vsum(@2..@7)
*** Level up:
| From | To | R2 bios | R1 bios |
|------+----+---------+---------|
|    1 | 40 |     131 |     261 |
|   40 | 45 |     163 |     325 |
|   45 | 50 |     349 |     697 |
|   50 | 55 |     749 |    1498 |
|   55 | 60 |    1612 |    3224 |
|------+----+---------+---------|
|    1 | 60 |    3004 |    6005 |
#+TBLFM: @7$3=vsum(@2..@6)
#+TBLFM: @7$4=vsum(@2..@6)

*** Skills
| From | To | Gold 1skill | Gold 5 skills |
|------+----+-------------+---------------|
|    1 |  2 |      105000 |        525000 |
|    2 |  3 |      273000 |       1365000 |
|    3 |  4 |      438900 |       2194500 |
|    4 |  5 |      604800 |       3024000 |
|    5 |  6 |      772800 |       3864000 |
|------+----+-------------+---------------|
|      |    |             |      10972500 |
#+TBLFM: $4 = $3 * 5
#+TBLFM: @7$4=vsum(@2..@6)

*** Gear up (+5 to +15)
*** Gear up (+15 to +20)

** Cards
** BAM
| R |  pGold | Gold from r1 | R1BAM | pBAM |
|---+--------+--------------+-------+------|
| 2 | 125000 |       125000 |    50 |   50 |
| 3 | 187500 |       437500 |   100 |    2 |
| 4 | 250000 |      1062500 |   200 |    2 |
| 5 | 312500 |      2437500 |   400 |    2 |
| 6 | 375000 |      5250000 |   800 |    2 |

r3 = 2*r2 + 187500 = 438500
r4 = 2*r3 + 250000 = 1127000
r5 = 2*r4 + 312500 = 2566500
r6 = 2*r5 + 375000 = 5508000
